---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.FaceSplitFailed
source: html/d052b690-ccde-a7c4-27ae-c2ddb8c0f5ea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.FaceSplitFailed Property

A face of a joined (i.e. one cuts another) mass could not be split into interior and exterior faces. Remove the cut to resolve.

## Syntax (C#)
```csharp
public static FailureDefinitionId FaceSplitFailed { get; }
```